app/controllers/todos_controller.rb

INSERT INTO "todos" ("name", "checked", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "wef"], ["checked", "f"], ["created_at", "2016-03-02 08:14:00.968209"], ["updated_at", "2016-03-02 08:14:00.968209"]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
  def destroy
    @todo = Todo.find(params[:id])
    if @todo.destroy